Revit 2027 API
Connector.AssignedPipeLossMethod Property
The pipe loss method of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeLossMethodType AssignedPipeLossMethod { get; }
Public ReadOnly Property AssignedPipeLossMethod As PipeLossMethodType
	Get
public:
property PipeLossMethodType AssignedPipeLossMethod {
	PipeLossMethodType get ();
}
member AssignedPipeLossMethod : PipeLossMethodType with get
Property Value
PipeLossMethodType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainPiping. Thrown when the connector is not in a family instance.
InvalidOperationException |  Thrown on failure to get pipe loss method.
Remarks
Assigned duct pipe loss method may be assigned for connectors of some family instances.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace